app/views/movies/show.erb

        <!-- categories -->
        <% if @movie.categories.present? %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."movie_id" = $1  [["movie_id", 44]]