app/views/movies/partials/_form.html.erb

SELECT "categories".* FROM "categories"
---
                    <%= f.label :genre %>
                  <%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) %>