app/controllers/application_controller.rb

    def current_user
        # this will only run if session has the user_id else it will return nil
        # and run an exception
              User.find(session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]