app/controllers/likes_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
INSERT INTO "likes" ("movie_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movie_id", 40], ["user_id", 8], ["created_at", "2024-09-06 13:58:54.381706"], ["updated_at", "2024-09-06 13:58:54.381706"]]
---
    def create
        @movie = Movie.find(params[:movie_id])
        @movie.likes.create!(user: current_user)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."movie_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["movie_id", 40], ["user_id", 8], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 4]]
---
    def destroy
        @movie = Movie.find(params[:movie_id])
        like = @movie.likes.find_by(user: current_user)

        if like
          like.destroy