app/controllers/likes_controller.rb

  def create
    @movie = Movie.find_by!(slug: params[:movie_id])
    @movie.likes.create!(user: current_user)
---
SELECT "movies".* FROM "movies" WHERE "movies"."slug" = $1 LIMIT $2  [["slug", "her-4"], ["LIMIT", 1]]
INSERT INTO "likes" ("movie_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["movie_id", 44], ["user_id", 11], ["created_at", "2024-09-14 12:20:42.148270"], ["updated_at", "2024-09-14 12:20:42.148270"]]