app/controllers/movies_controller.rb

  def show
    #fail # this a old way debugging trick
    # @movie = Movie.find(1)
    find_movie
    @likers =  find_movie.likers

    if current_user
    @like = current_user.likes.find_by(movie_id:  find_movie.id)
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."movie_id" = $2 LIMIT $3  [["user_id", 8], ["movie_id", 40], ["LIMIT", 1]]

  def update
    #  we need the movies id again , because instance variable
    # donot live on after the action runs, thats why we called it here
    # again despite calling it on edit.
    find_movie
    if @movie.update(permitted_values)
---
UPDATE "movies" SET "updated_at" = $1, "description" = $2 WHERE "movies"."id" = $3  [["updated_at", "2024-09-12 21:47:04.347149"], ["description", "In a near future, a lonely writer develops an unlikely relationship"], ["id", 44]]

  def create
    @movie = Movie.new(permitted_values)
    if @movie.save
---
INSERT INTO "movies" ("name", "actor", "price", "created_at", "updated_at", "producer", "net_worth", "release_year", "starts_at", "description", "image_file_name", "capacity") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def destroy
    find_movie
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 30]]

  def find_movie
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]