app/controllers/movies_controller.rb

SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."movie_id" = $1  [["movie_id", 44]]
---
  def show
    #fail # this a old way debugging trick
    # @movie = Movie.find(1)

    # already call above " before_action :find_movie, only: [:show, :edit, :update, :destroy]"
    # find_movie

    @likers =  find_movie.likers
    @categories = find_movie.categories

    if current_user
    @like = current_user.likes.find_by(movie_id:  find_movie.id)

INSERT INTO "movies" ("name", "actor", "price", "created_at", "updated_at", "producer", "net_worth", "release_year", "starts_at", "description", "image_file_name", "capacity", "slug") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @movie = Movie.new(permitted_values)
    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."slug" = $1 LIMIT $2  [["slug", "her-4"], ["LIMIT", 1]]
---
  def find_movie
    # @movie = Movie.find(params[:id])  [REMEMBER TO CHANGE THIS ONN REGISTRATION AND LIKE]
    # AND OTHER PLACES THAT FINDS BY ID
    @movie = Movie.find_by!(slug: params[:id])