app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "actor", "price", "created_at", "updated_at", "producer", "net_worth", "release_year", "starts_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @movie = Movie.new(permitted_values)
    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]
---
  def find_movie
    @movie = Movie.find(params[:id])