app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("name", "email", "how_heard", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "lucy"], ["email", "lucy@msa.com"], ["how_heard", "Friend/Coworker"], ["movie_id", 52], ["created_at", "2024-08-23 23:15:26.104841"], ["updated_at", "2024-08-23 23:15:26.104841"]]
---
    def create
    #    set_movie_id
        @registration = @movie.registrations.new(registration_params)

     if @registration.save

UPDATE "registrations" SET "how_heard" = $1, "updated_at" = $2 WHERE "registrations"."id" = $3  [["how_heard", "google"], ["updated_at", "2024-08-25 19:26:54.056700"], ["id", 1]]
---
      def update
        if @registration.update(registration_params)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
    def set_movie_id
        @movie = Movie.find(params[:movie_id])

SELECT "registrations".* FROM "registrations" WHERE "registrations"."movie_id" = $1 AND "registrations"."id" = $2 LIMIT $3  [["movie_id", 52], ["id", 1], ["LIMIT", 1]]
---
    def set_registration
        @registration = @movie.registrations.find(params[:id])