app/controllers/registrations_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."slug" = $1 LIMIT $2  [["slug", "her-4"], ["LIMIT", 1]]
---
  def set_movie_id
    @movie = Movie.find_by!(slug: params[:movie_id])