app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "moe@gmail.com"], ["LIMIT", 1]]
---
    def create
#    params[:email]
#    params[:password]


 # Find the user by their email address provided in the form parameters
 user = User.find_by(email: params[:email])