app/controllers/users_controller.rb

  def update
    #  we need the movies id again , because instance variable
    # donot live on after the action runs, thats why we called it here
    # again despite calling it on edit.

    # set_user_id
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Muhammad"], ["password_digest", "[FILTERED]"], ["updated_at", "2024-09-01 20:14:27.143024"], ["id", 1]]

    def create
            @user = User.new(user_params)

         if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Musa"], ["email", "musa@msa.com"], ["password_digest", "[FILTERED]"], ["created_at", "2024-09-03 22:19:36.842729"], ["updated_at", "2024-09-03 22:19:36.842729"], ["admin", false]]

        def destroy
            # set_user_id
            @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]

          def require_correct_user
            # since the "@user = User.find(params[:id])" is requried to run before action
            # we can call it here and use it in the require_correct_user method
            # and also avvoid duplication in other methods above
            @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

          def set_user_id
            @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]