app/views/layouts/_header.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
                <!-- this defines the current user
                User.find(session[:user_id]).name